JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
#include "stm32_assert.h"
#include "stm32_cpu_delay.h"
#include "usbd_core.h"
#include "usbd_request.h"
#include "usbd_hw.h"

enum usbd_event
{
	NONE = 0,
	RESET,
	CTR,
	SETUP,
	SUSPEND,
	WAKEUP,
	PMAOVR,
	SOF,
	ESOF,
	LPM_L1,
	ERROR
};
#define USBD_MAX_EVENT 11

struct usbd_requests
{
	void (*get_status)(usbd_setup_packet_type setup);
	void (*clear_feature)(usbd_setup_packet_type setup);
	void (*set_feature)(usbd_setup_packet_type setup);
	void (*set_address)(usbd_setup_packet_type setup);
	void (*get_descriptor)(usbd_setup_packet_type setup);
	void (*set_descriptor)(usbd_setup_packet_type setup);
	void (*get_configuration)(usbd_setup_packet_type setup);
	void (*set_configuration)(usbd_setup_packet_type setup);
	void (*get_interface)(usbd_setup_packet_type setup);
	void (*set_interface)(usbd_setup_packet_type setup);
	void (*synch_frame)(usbd_setup_packet_type setup);
	void (*class_request)(usbd_setup_packet_type setup);
	void (*vendor_request)(usbd_setup_packet_type setup);
};


static uint8_t *ep0_buf;
static uint32_t ep0_cnt;
static void (*stage)(void);
static void (*reception_completed)(void);
static struct usbd_requests const *cur_state;
static struct usbd_requests const *prev_state;
static uint16_t device_address;
static usbd_core_config *config;
static void (*ep_handler[8][2])(void);
static void (*cur_ep_handler)(void);

static struct usbd_queue
{
	enum usbd_event buffer[USBD_MAX_EVENT + 1];
	uint32_t head;
	uint32_t tail;
}queue;

#define USBD_QUEUE_NEXT_HEAD() ((queue.head + 1 == USBD_MAX_EVENT) ? 0 : (queue.head + 1))
#define USBD_QUEUE_NEXT_TAIL() ((queue.tail + 1 == USBD_MAX_EVENT) ? 0 : (queue.tail + 1))
#define USBD_QUEUE_IS_EMPTY() ((queue.head == queue.tail) ? 1 : 0)
#define USBD_QUEUE_IS_FULL() ((USBD_QUEUE_NEXT_HEAD() == queue.tail) ? 1 : 0)

static void usbd_ep0_handler(void);
static void usbd_setup_stage(void);
static void usbd_data_out_stage(void);
static void usbd_data_in_stage(void);
static void usbd_status_in_stage(void);
static void usbd_status_out_stage(void);

static void usbd_parse_setup_packet(usbd_setup_packet_type setup);

static void usbd_get_status(usbd_setup_packet_type setup);
static void usbd_clear_feature(usbd_setup_packet_type setup);
static void usbd_set_feature(usbd_setup_packet_type setup);
static void usbd_set_address(usbd_setup_packet_type setup);
static void usbd_get_descriptor(usbd_setup_packet_type setup);
static void usbd_set_descriptor(usbd_setup_packet_type setup);
static void usbd_get_configuration(usbd_setup_packet_type setup);
static void usbd_set_configuration(usbd_setup_packet_type setup);
static void usbd_get_interface(usbd_setup_packet_type setup);
static void usbd_set_interface(usbd_setup_packet_type setup);
static void usbd_synch_frame(usbd_setup_packet_type setup);
static void usbd_class_request(usbd_setup_packet_type setup);
static void usbd_vendor_request(usbd_setup_packet_type setup);

static void usbd_event_enqueue(enum usbd_event e);
static enum usbd_event usbd_event_dequeue(void);
static void usbd_event_generator(void);
static void usbd_reset(void);
static void usbd_device_event_handler(enum usbd_event e);

static const struct usbd_requests default_state =
{
	NULL,
	NULL,
	NULL,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL
};

static const struct usbd_requests addressed_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	usbd_get_configuration,
	usbd_set_configuration,
	NULL,
	NULL,
	NULL,
	NULL,
	usbd_vendor_request
};

static const struct usbd_requests configured_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	NULL,
	usbd_get_descriptor,
	usbd_set_descriptor,
	usbd_get_configuration,
	usbd_set_configuration,
	usbd_get_interface,
	usbd_set_interface,
	usbd_synch_frame,
	usbd_class_request,
	usbd_vendor_request
};

static const struct usbd_requests suspended_state;

static void usbd_ep0_handler(void)
{
	ASSERT(stage != NULL);
	stage();
}

static void usbd_setup_stage(void)
{
	usbd_setup_packet_type setup;
	USBD_EP_CLEAR_CTR_RX(EP0);
	uint16_t count = USBD_PMA_GET_RX_COUNT(EP0);
	ASSERT(count == sizeof(usbd_setup_packet_type));
	usbd_pma_read(ADDR0_RX, (uint8_t*)&setup, count);
	usbd_parse_setup_packet(setup);
	USBD_EP_SET_RX_VALID(EP0);
}

static void usbd_data_in_stage(void)
{
	uint32_t cnt = MIN(USBD_FS_MAXPACKETSIZE, ep0_cnt);
	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;
	
	USBD_EP_CLEAR_CTR_TX(EP0);
	/*If there is no leftover data, Data In stage is completed.*/
	if (!ep0_cnt)
	{
		USBD_EP_SET_KIND(EP0);
		stage = usbd_status_out_stage;
		return;
	}
	/*Increment the buffer.*/
	ep0_buf += cnt;
	/*Copy a packet to usb sram*/
	USBD_PMA_SET_TX_COUNT(EP0, MIN(EP0_COUNT, ep0_cnt));
	usbd_pma_write(ep0_buf, ADDR0_TX, MIN(EP0_COUNT, ep0_cnt));
	USBD_EP_SET_TX_VALID(EP0);
}

static void usbd_data_out_stage(void)
{
	USBD_EP_CLEAR_CTR_RX(EP0);
	/*Get the rx count and protect from underflow.*/
	uint32_t cnt = MIN(USBD_PMA_GET_RX_COUNT(EP0), ep0_cnt);
	
	usbd_pma_read(ADDR0_TX, ep0_buf, cnt);

	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;

	/*If there is leftover data, increment the buffer pointer.*/
	if (ep0_cnt)
	{
		ep0_buf += cnt;
	}
	/*Otherwise the stage is completed.*/
	else
	{
		stage = usbd_status_in_stage;
	}
	USBD_EP_SET_RX_VALID(EP0);
}

static void usbd_status_in_stage(void)
{
	USBD_EP_CLEAR_CTR_TX(EP0);
	if (device_address && cur_state == &default_state)
	{
		cur_state = &addressed_state;
		/*Set the device address.*/
		SET(USB->DADDR, device_address);
	}

	if (!device_address && cur_state == &addressed_state)
	{
		cur_state = &default_state;
		/*Clear the device address*/
		CLEAR(USB->DADDR, USB_DADDR_ADD);
	}

	if(reception_completed != NULL)
	{
		reception_completed();
	}

	USBD_PMA_SET_TX_COUNT(EP0, 0);
	
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	USBD_EP_SET_TX_VALID(EP0);
}

static void usbd_status_out_stage(void)
{
	USBD_EP_CLEAR_CTR_RX(EP0);
	/*Clear hardware status out*/
	USBD_EP_CLEAR_KIND(EP0);
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	USBD_EP_SET_RX_VALID(EP0);
}

static void usbd_parse_setup_packet(usbd_setup_packet_type setup)
{
    switch(setup.bmRequestType & USBD_REQUEST_TYPE)
    {
        case USBD_REQUEST_TYPE_STANDARD:
        {
            switch(setup.bRequest)
            {
                case USBD_REQUEST_GET_STATUS:
                {
					ASSERT(cur_state->get_status != NULL);
                    cur_state->get_status(setup);
                    break;
                }
                case USBD_REQUEST_CLEAR_FEATURE:
                {
					ASSERT(cur_state->clear_feature != NULL);
					cur_state->clear_feature(setup);
                    break;
                }
                case USBD_REQUEST_SET_FEATURE:
                {
					ASSERT(cur_state->set_feature != NULL);
					cur_state->set_feature(setup);
                    break;            
                }
                case USBD_REQUEST_SET_ADDRESS:
                {
					ASSERT(cur_state->set_address != NULL);
					cur_state->set_address(setup);
                    break;            
                }
                case USBD_REQUEST_GET_DESCRIPTOR:
                {
					ASSERT(cur_state->get_descriptor != NULL);
					cur_state->get_descriptor(setup);
                    break;            
                }
                case USBD_REQUEST_SET_DESCRIPTOR:
                {
					ASSERT(cur_state->set_descriptor != NULL);
                    cur_state->set_descriptor(setup);
                    break;            
                }
                case USBD_REQUEST_GET_CONFIGURATION:
                {
					ASSERT(cur_state->get_configuration != NULL);
                    cur_state->get_configuration(setup);
                    break;
                }
                case USBD_REQUEST_SET_CONFIGURATION:
                {
					ASSERT(cur_state->set_configuration != NULL);
                    cur_state->set_configuration(setup);
                    break;            
                }
                case USBD_REQUEST_GET_INTERFACE:
                {
					ASSERT(cur_state->get_interface != NULL);
                    cur_state->get_interface(setup);
                    break;
                }
                case USBD_REQUEST_SET_INTERFACE:
                {
					ASSERT(cur_state->set_interface != NULL);
                    cur_state->set_interface(setup);
                    break;
                }
                case USBD_REQUEST_SYNCH_FRAME:
                {
					ASSERT(cur_state->synch_frame != NULL);
                    cur_state->synch_frame(setup);
                    break;
                }
                default:
                {
                    USBD_DEV_ERR(Invalid bRequest.);
                    break;
                }
            }
            break;
        }
        case USBD_REQUEST_TYPE_CLASS:
        {
			ASSERT(cur_state->class_request != NULL);
            cur_state->class_request(setup);
            break;
        }
        case USBD_REQUEST_TYPE_VENDOR:
        {
			ASSERT(cur_state->vendor_request != NULL);
			cur_state->vendor_request(setup);
            break;
        }
        default:
        {
            USBD_DEV_ERR(Invalid bmRequestType. Unknown request type.);
        }
    }
}

static void usbd_get_status(usbd_setup_packet_type setup)
{
	uint8_t buf[2] = { 0x0U, 0x0U };

	switch (setup.bmRequestType & USBD_REQUEST_RECIPIENT)
	{
		case USBD_REQUEST_RECIPIENT_DEVICE:
		{	
			ASSERT(config != NULL);
			ASSERT(config->get_remote_wakeup != NULL);
			ASSERT(config->is_selfpowered != NULL);
			buf[0] = config->get_remote_wakeup() ? 1 << 1 : 0 << 1;
			buf[0] |= config->is_selfpowered() ? 1 : 0;
			break;	
		}
		case USBD_REQUEST_RECIPIENT_INTERFACE:
		{
			ASSERT(config != NULL);
			ASSERT(config->is_interface_valid != NULL);

