JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
			if(!config->is_interface_valid(setup.wIndex & 0x7FU))
			{
				USBD_DEV_ERR(Invalid interface.);
				return;
			}
			break;
		}
		case USBD_REQUEST_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & 0xF);
			uint8_t dir =  (setup.wIndex & 0x80) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_DEV_ERR(Invalid endpoint.);
				return;
			}
			buf[0] = (uint8_t) USBD_EP_GET_STALL(ep, dir) ? 1: 0;
			break;

		}
		default:
		{
			USBD_DEV_ERR(Invalid bmRequestType. Unknown recipient);
			return;
			break;			
		}
	}
	usbd_prepare_data_in_stage(buf, 2);
}

static void usbd_clear_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_REQUEST_RECIPIENT)
	{
		case USBD_REQUEST_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(false);
			break;	
		}
		case USBD_REQUEST_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & 0xF);
			uint8_t dir =  (setup.wIndex & 0x80) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_DEV_ERR(Invalid endpoint.);
				return;
			}
			ASSERT(config->clear_stall != NULL);
			config->clear_stall(ep, dir);
			break;
		}
		default:
		{
			USBD_DEV_ERR(Invalid bmRequestType. Unknown recipient);
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

static void usbd_set_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_REQUEST_RECIPIENT)
	{
		case USBD_REQUEST_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(true);
			break;	
		}
		case USBD_REQUEST_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & 0xF);
			uint8_t dir =  (setup.wIndex & 0x80);
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_DEV_ERR(Invalid endpoint.);
				return;
			}
			if (dir)
			{
				USBD_EP_SET_TX_STALL(ep);
			}
			else
			{
				USBD_EP_SET_RX_STALL(ep);
			}
			break;
		}
		default:
		{
			USBD_DEV_ERR(Invalid bmRequestType. Unknown recipient);
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

static void usbd_set_address(usbd_setup_packet_type setup)
{
	device_address = setup.wValue;
	usbd_prepare_status_in_stage();
}

static void usbd_get_descriptor(usbd_setup_packet_type setup)
{
	uint8_t *buf = NULL;
	uint32_t cnt = 0;

	switch ((((setup.wValue) >> 0x8U) & 0xFFU))
	{
		case USBD_REQUEST_DESC_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->device_descriptor != NULL);
			buf = config->device_descriptor();
			cnt = setup.wLength;
			break;
		}
		case USBD_REQUEST_DESC_CONFIGURATION:
		{
			ASSERT(config != NULL);
			ASSERT(config->configuration_descriptor != NULL);
			buf = config->configuration_descriptor(setup.wValue & 0xFFU);
			cnt = MIN(setup.wLength, (buf[2] | buf[3] << 8));
			break;
		}
		case USBD_REQUEST_DESC_STRING:
		{
			ASSERT(config != NULL);
			ASSERT(config->string_descriptor != NULL);
			buf = config->string_descriptor((setup.wValue & 0xFFU), setup.wIndex);
			cnt = MIN(setup.wLength, buf[0]);
			break;
		}		
		case USBD_REQUEST_DESC_BOS:
		{
			ASSERT(config != NULL);
			ASSERT(config->bos_descriptor != NULL);
			buf = config->bos_descriptor();
			cnt = setup.wLength;
			break;
		}
		default:
		{
			USBD_DEV_ERR(Invalid descriptor request);
			return;
			break;
		}
	}
	usbd_prepare_data_in_stage(buf, cnt);
}

static void usbd_set_descriptor(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->set_descriptor != NULL);
	config->set_descriptor(setup);
}

static void usbd_get_configuration(usbd_setup_packet_type setup)
{
	UNUSED(setup);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->get_configuration != NULL);
	buf = config->get_configuration();
	usbd_prepare_data_in_stage(&buf, 1);
}

static void usbd_set_configuration(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_configuration_valid != NULL);
	if(!config->is_configuration_valid(num))
	{
		USBD_DEV_ERR(Invalid configuration.);
		return;
	}
	ASSERT(config->set_configuration != NULL);
	config->set_configuration(num);
	cur_state = num ? &configured_state : &addressed_state;
	usbd_prepare_status_in_stage();
}

static void usbd_get_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if(!config->is_interface_valid(num))
	{
		USBD_DEV_ERR(Invalid interface);
		return;
	}
	ASSERT(config->get_interface != NULL);
	buf = config->get_interface(num);
	usbd_prepare_data_in_stage(&buf, 1);
}

static void usbd_set_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t alt = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if (!config->is_interface_valid(num))
	{
		USBD_DEV_ERR(Invalid interface.);
	}
	ASSERT(config->set_interface != NULL);
	config->set_interface(num, alt);
	usbd_prepare_status_in_stage();	
}

static void usbd_synch_frame(usbd_setup_packet_type setup)
{
	uint8_t ep = (setup.wIndex & 0xFF);
	uint8_t buf[2];
	/*@todo check if endpoint iso*/
	/*@todo get frame number*/
	usbd_prepare_data_in_stage(buf, 2);
}

static void usbd_class_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->class_request != NULL);
	config->class_request(setup);
}

static void usbd_vendor_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->vendor_request != NULL);
	config->vendor_request(setup);
}

static void usbd_event_enqueue(enum usbd_event e)
{
	ASSERT(!USBD_QUEUE_IS_FULL());
	queue.buffer[queue.head] = e;
	queue.head = USBD_QUEUE_NEXT_HEAD();
}

static enum usbd_event usbd_event_dequeue(void)
{
	enum usbd_event e = NONE;
	if (!USBD_QUEUE_IS_EMPTY())
	{
		e = queue.buffer[queue.tail];
		queue.tail = USBD_QUEUE_NEXT_TAIL();
	}
	return e;
}

